tutorials/06POD_RBF/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesU 8;
NmodesP 8;
NmodesSUP 8;
NmodesNUT 8;
NmodesProject 30;
NmodesMatrixRec 7;
tolerance  1e-6;
maxIter    1500;

// Boundary method
BCMethod lift;

// eddy viscosity coefficients computation method
viscCoeff RBF;

// Export Reduced Matrices
exportPython 1;
exportMatlab 1;
exportTxt 1;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;
